M=1048576;
b=1;
r=2045;
s=zeros(1,10000);
s(1)=12357;
for i =2:10000
       s(i)=mod(s(i-1)*r+b,M);
end
s=s/M;                   %用线性同余法产生10000个随机数保存在矩阵s中
m=zeros(1,4);            %建立一个矩阵用来保存求出来的一到四阶矩
for i =1:10000           %用一个for循环同步求出四阶矩，并保存在矩阵中
       m(1)=m(1)+s(i);
       m(2)=m(2)+s(i)^2;
       m(3)=m(3)+s(i)^3;
       m(4)=m(4)+s(i)^4;
end
m=m/10000;               %除以个数得到真正的四阶矩
n=zeros(1,2);            %建立一个矩阵用来保存求出来的最大值和最小值
n(1)=s(1);
n(2)=s(1);
for j= 1:10000           %用for循环依次比较，求出最大最小值
    if(n(1)<s(j))
        n(1)=s(j);
    end
    if(n(2)>s(j))
        n(2)=s(j);
    end
end

hist(s),title("0到1均匀分布直方图");                 %打印直方图